# ATFBaseExportOptions Properties (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
ATFBaseExportOptions Properties
ATFBaseExportOptions Class See Also
---
The ATFBaseExportOptions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| ViewId | The element id of the 3D view to export. InvalidElementId by default. |

# See Also
ATFBaseExportOptions Class
Autodesk.Revit.DB Namespace